nc: 7
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]
  - [-1, 2, DSC3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]
  - [-1, 2, DSC3k2, [512, False, 0.25]]
  - [-1, 1, ODER, [512, 1, 4, 3.0, 1.1, 0.5, 4000]]
  - [-1, 1, DSConv, [512, 3, 2]]
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, ODER, [512, 1, 4, 3.0, 1.1, 0.5, 4000]]
  - [-1, 1, DSConv, [1024, 3, 2]]
  - [-1, 4, A2C2f, [1024, True, 1]]

head:
  - [[5, 8, 10], 1, HSSF, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [11, 1, DownsampleConv, []]
  - [[8, 11], 1, FullPAD_Tunnel, []]
  - [[5, 12], 1, FullPAD_Tunnel, []]
  - [[10, 13], 1, FullPAD_Tunnel, []]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 11], 1, FullPAD_Tunnel, []]

  - [19, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [256, True]]
  - [12, 1, Conv, [256, 1, 1]]
  - [[23, 24], 1, FullPAD_Tunnel, []]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 11], 1, FullPAD_Tunnel, []]

  - [28, 1, Conv, [512, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [1024, True]]
  - [[-1, 13], 1, FullPAD_Tunnel, []]

  - [[25, 29, 33], 1, Detect, [nc]]
